api/models/User.php

	public static function findByUsernameWithRoles($username, $roles)
	{
		/** @var User $user */
		$user = static::find()->where([
			'username'  =>  $username,
			'status'    =>  self::STATUS_ACTIVE,

		])->andWhere(['in', 'role', $roles])->one();
---
SELECT * FROM `user` WHERE ((`username`='staff') AND (`status`=10)) AND (`role` IN (99, 50))

    public function generateAccessTokenAfterUpdatingClientInfo($forceRegenerate=false)
    {
        // update client login, ip
        $this->last_login_ip = Yii::$app->request->userIP;
        $this->last_login_at = new Expression('NOW()');

        // check time is expired or not
        if($forceRegenerate == true
            || $this->access_token_expired_at == null
            || (time() > strtotime($this->access_token_expired_at)))
        {
            // generate access token
            $this->generateAccessToken();
        }
        $this->save(false);
---
UPDATE `user` SET `access_token_expired_at`='2017-08-18 10:27:25', `last_login_at`=NOW(), `updated_at`='2017-08-17 10:27:23' WHERE `id`=3